Tekla.Structures.CatalogInternal.MetadataSchema
A strongly-typed resource class, for looking up localized strings, etc.

Tekla.Structures.CatalogInternal.MetadataSchema.ResourceManager
Returns the cached ResourceManager instance used by this class.

Tekla.Structures.CatalogInternal.MetadataSchema.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Tekla.Structures.CatalogInternal.MetadataSchema.ShapeImportMetadataSchema
Looks up a localized string similar to <?xml version="1.0" encoding="utf-8"?>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema"
elementFormDefault="qualified">
<xsd:element name="ImportShape" type="ImportShapeDataType"/>
<xsd:complexType name="ImportShapeDataType">
<xsd:sequence>
<xsd:element name="GeometryFileReference" type="xsd:string" minOccurs="1" maxOccurs="1"/>
<xsd:element name="ImageFileReference" type="xsd:string" minOccurs="0" maxOccurs="1"/>
<xsd:element name="ProductName" type="xsd:string" minO [rest of string was truncated]";.